Repository: lawrancej/logisim
Catalog: xlate/ru/doc/omegat-logisim-doc_ru-omegat.tmx
Source language: en
Languages: ru_ru

source: Our General Public Licenses are designed to make sure that you have the freedom to distribute copies of free software (and charge for this service if you wish), that you receive source code or can get it if you want it, that you can change the software or use pieces of it in new free programs; and that you know you can do these things.
ru_ru: Предполагается, что наши Универсальные Общественные Лицензии гарантируют, что вы пользуетесь свободой распространять копии свободного ПО (и получать за это вознаграждение, если вы того желаете); что вы получаете исходный код или можете получить его, если захотите; что вы можете изменять ПО или использовать его части в новых свободных программах; и что вы знаете, что вы можете все это делать.

source: NAND
ru_ru: И-НЕ

source: Logisim does nothing with respect to discriminating between voltage levels: A bit can be only on, off, unspecified, or error.
ru_ru: Logisim не делает ничего в отношении различий между уровнями напряжения: бит может быть только включенным, выключенным, неопределённым, или ошибкой.

source: However, a developer typically configures the JAR library to avoid this (by including a manifest file in the JAR with a Library-Class attribute specifying the main class name).)
ru_ru: Впрочем, разработчик обычно настраивает JAR библиотеку так, чтобы избежать этого (включением в JAR файла manifest с атрибутом Library-Class, указывающим имя главного класса).)

source: Each project has only one logging window; when you switch to viewing another circuit within the project, the logging window switches automatically to logging the other circuit instead.
ru_ru: Каждый проект имеет только одно окно журнала; когда вы переключаетесь на просмотр другой схемы проекта, окно журнала автоматически переключается на запись журнала для другой схемы.

source: Note that displaying information during the simulation makes the simulation go much slower.
ru_ru: Обратите внимание, что отображение информации в ходе моделирования сильно его замедляет.

source: Input/Output
ru_ru: Ввод/вывод

source: West edge, labeled D (input, bit width matches Data Bits attribute)
ru_ru: Западный край, отмечен D (вход, разрядность соответствует атрибуту Биты данных)

source: Now we want to add the two inputs x and y into the diagram.
ru_ru: Теперь мы хотим добавить в чертёж два входа х и у.

source: Provides the font selection dialog box that pops up when selecting font attributes (such as with the Label Font attribute of many components).
ru_ru: Предоставляет диалоговое окно выбора шрифта, которое всплывает при выборе атрибутов шрифта (как в атрибуте Шрифт метки многих компонентов).

source: When chaining priority encoders together, this output can be used to identify which of the encoders was triggered.
ru_ru: Когда шифраторы приоритетов соединены вместе, этот выход может быть использован чтобы определить, какой из шифраторов сработал.

source: Note: Logisim's clipboard is maintained separately from the clipboard for the overall system; as a result, cut/copy/paste will not work across different applications, even including other running copies of Logisim.
ru_ru: Примечание: буфер Logisim поддерживается отдельно от буфера для всей системы; в результате вырезать/копировать/вставить не будет работать в других приложений, даже включая другие запущенные копии Logisim.

source: Enable In: if 0, the component is disabled; otherwise the component is enabled.
ru_ru: Разрешающий вход: Если 0, то компонент отключен, в противном случае компонент включен.

source: // the setPorts invocation above, the component's input was included at
ru_ru: // вызове setPorts выше, вход компонента был включен

source: Still, it can be occasionally useful to ensure that values propagate in only one direction along a wire.
ru_ru: Тем не менее, он может быть иногда полезен для уверенности в том, что значение передаётся по проводу только в одном направлении.

source: Resizes the current window to its preferred size.
ru_ru: Изменяет размер текущего окна до оптимального размера.

source: North edge, second from left (input, bit width 1)
ru_ru: Северный край, второй слева (вход, разрядность равна 1)

source: Clock - when triggered while the read-enable pin isn't 0, the leftmost character from the buffer is deleted, and the outputs are updated to reflect the buffer's new status.
ru_ru: Тактовый вход - когда срабатывает при ненулевом значении контакта разрешения чтения, крайний левый символ буфера удаляется, и выходы обновляются чтобы отразить новое состоянию буфера.

source: Provides the integrated help system from the Help menu.
ru_ru: Обеспечивает встроенную систему помощи из меню "Справка".

source: The default appearance is very usable, and indeed Logisim existed for many years with no other option.
ru_ru: Внешний вид по умолчанию очень удобен, и фактически, Logisim существовал много лет без каких-либо других вариантов.

source: Priority Encoder
ru_ru: Шифратор приоритетов

source: The latter two
ru_ru: Последние два

source: Logisim is rather intelligent when adding wires: Whenever a wire ends at another wire, Logisim automatically connects them.
ru_ru: Logisim достаточно умён при добавлении проводов: каждый раз, когда провод кончается на другом проводе, Logisim автоматически соединяет их.

source: The transmission gate is simply the combination of two complementary transistors.
ru_ru: Передаточный вентиль - это просто комбинация двух комплементарных транзисторов.

source: The text within the label associated with the clock component.
ru_ru: Текст внутри метки, привязанной к компоненту Тактовый генератор.

source: You can enable this behavior by going to the Project > Options… menu item, selecting the Simulation tab, and selecting Error for undefined inputs for Gate Output When Undefined.
ru_ru: Вы можете включить это поведение, выбрав меню Проект > Параметры…, перейдя на вкладку Моделирование, и выбрав вариант Ошибка для неопределённых входов для Выход элемента при неопределённости.

source: "Base" means that the baseline should intersect the location; "Top" means that the text's top should intersect the location; "Bottom" means that the text's bottom should intersect the location; and "Center" means that the text should be centered (vertically) at the location.
ru_ru: "По базовой" означает, что базовая линия должна пересекать это место; "По верху" означает, что верх текста должен пересекать это место; "По низу" означает, что низ текста должен пересекать это место; "По центру" означает, что текст должен быть центрирован (вертикально) по этому месту.

source: machine-readable copy of the corresponding source code, to be
ru_ru: машиночитаемую копию соответствующего исходного кода,

source: When the clock input (indicated by a triangle on the south edge) indicates so, the value stored in the register changes to the value of the D input at that instant.
ru_ru: Когда указывает тактовый вход (отмеченный треугольником на южном крае), значение, хранящееся в регистре, меняется в этот момент на значение на входе D.

source: To process several query files, you would like want to build a simple program such as a shell script to iterate through each and comparing the output.
ru_ru: Для обработки нескольких проверяемых файлов вы можете написать простую программу типа сценария оболочки для поочерёдного прохода по файлам и их сравнения.

source: The attributes associated with the tools are not displayed in this window; instead, you can view and edit them within the main drawing window.
ru_ru: Атрибуты, связанные с инструментами, не отображаются в этом окне, вместо этого вы можете просматривать и редактировать их в главном окне рисования программы.

source: When 0 or disconnected, no load occurs.
ru_ru: Когда на нём 0 или он не подключен, никакой загрузки не происходит.

source: Determines how many pins to have for the component on its west side.
ru_ru: Определяет, сколько контактов на западном крае будет иметь компонент.

source: If, however, the quotient does not fit into dataBits bits, then only the lower dataBits bits will be reported.
ru_ru: Если, однако, частное не умещается в битыДанных битов, то только младшие битыДанных битов будут переданы.

source: In our example, the anchor is facing east, and each instance of the subcircuit in the 4:1 multiplexer is also facing east, so they are all drawn in the same orientation as the 2:1 multiplexer's appearance.
ru_ru: В нашем примере якорь направлен на восток, и каждый экземпляр подсхемы в мультиплексоре 4:1 тоже направлен на восток, поэтому они все отрисованы в том же направлении, что и внешний вид мультиплексора 2:1.

source: Indeed, the same behavior can be achieved in Logisim by using just one transistor.
ru_ru: Фактически, то же поведение может быть достигнуто в Logisim с помощью всего одного транзистора.

source: When three or more inputs are provided, the XOR/XNOR gate's output will either be based on whether exactly one input is 1 (the default) or an odd number of inputs are 1.
ru_ru: Когда входов три или более, то значение на выходе элементов Исключающее ИЛИ и Исключающее ИЛИ-НЕ будет основано или на том, что 1 строго на одном входе (по умолчанию), или на нечётном количестве входов.

source: If any of the bits are floating or error, then a dash ('-') is displayed.
ru_ru: Если какой-либо бит имеет плавающее значение или значение ошибки, то отображается тире ('-').

source: The ROM component stores up to 16,777,216 values (specified in the Address Bit Width attribute), each of which can include up to to 32 bits (specified in the Data Bit Width attribute).
ru_ru: Компонент ПЗУ хранит до 16777216 значений (это задаётся в атрибуте Разрядность адреса), каждое из которых может включать до 32 битов (задаётся в атрибуте Разрядность данных).

source: The source code to Logisim is primarily my own work; I must acknowledge my employers who fund my work as a professor, including this program: I started the program at Saint John's University (Collegeville, Minnesota, USA) in 2000-2004, and I have continued it at Hendrix College (Conway, Arkansas, USA) from 2004 to present.
ru_ru: Исходный код Logisim - в основном моя собственная работа; я должен выразить признательность, моим работодателям, которые финансируют мою работу в качестве профессора, в том числе данную программу: я начал программу в Университете Сент-Джона (Коллегевилье, штат Миннесота, США) в 2000-2004 годах, и я продолжаю её в колледже Хендрикс (Конуэй, штат Арканзас, США) с 2004 года по настоящее время.

source: West edge (input, bit width matches Data Bits attribute)
ru_ru: Западный край (вход, разрядность соответствует атрибуту Биты данных)

source: The primary difference is that a transistor is meant for more basic circuit designs.
ru_ru: Основная разница в том, что транзистор предназначен для проектирования более элементарных схем.

source: (This does not work when loading the GUI - it is only for command-line execution.)
ru_ru: (Это не будет работать, когда загружен графический интерфейс - это только для выполнения в командной строке.)

source: Outputs the value currently stored by the component.
ru_ru: Выдаёт значение, хранящееся в данный момент в компоненте.

source: Clicking an input pin will toggle the bit that is clicked.
ru_ru: Нажатие на входной контакт будет переключать бит, на который нажали.

source: The clock's cycle can be configured using its High Duration and Low Duration attributes.
ru_ru: Цикл тактового генератора можно настроить через атрибуты Продолжительность единицы и Продолжительность нуля.

source: * for its label.
ru_ru: * для его метки.

source: If the values added together as unsigned values yield a result that fits into dataBits bits, then this bit will be 0; otherwise, it will be 1.
ru_ru: Если значения, складываемые как беззнаковые, дают результат, умещающийся в битыДанных битов, то на этом выходе будет 0, в противном случае - 1.

source: of this license document, but changing it is not allowed.
ru_ru: этого лицензионного документа, но изменять его нельзя.

source: The behavior is particularly useful for multi-bit wires, whose black color provide no visual feedback about what value the wire is carrying.
ru_ru: На практике такое поведение полезно для многобитных проводов, чёрный цвет которых не предоставляет никакой информации о том, какое значение передаёт провод.

source: Unloads current libraries from the project.
ru_ru: Выгружает текущие библиотеки из проекта.

source: The Minimized tab
ru_ru: Вкладка Минимизация

source: Clock input: At the instant that this input value rises from 0 to 1 (the rising edge), the register's value will be updated to the value of the D input.
ru_ru: Тактовый вход: в момент, когда значение на этом входе изменяется с 0 на 1 (передний фронт), значение регистра обновляется на значение входа D.

source: None of this will happen, though, if shift-clicking is mapped to another tool instead (via the project options window's Mouse tab).
ru_ru: Ничего из этого не произойдёт, впрочем, если нажатие мыши с зажатой клавишей Shift привязано к другому инструменту (через вкладку Мышь окна параметров проекта).

source: This is the entry point for any JAR file - the class whose name the user enters when loading the JAR library.
ru_ru: Это входная точка для любого JAR файла - класс, имя которого пользователь вводит при загрузке JAR библиотеки.

source: In simple Logisim circuits, most wires carry only one bit; but Logisim also allows you to create wires that bundle together multiple bits.
ru_ru: В простых схемах Logisim большинство проводов несут только один бит, но Logisim также позволяет вам создавать провода, связывающие вместе несколько битов.

source: Computes the two's-complement negation of the input.
ru_ru: Вычисляет отрицание для входного значения в дополнительном коде.

source: If they all match, then we're done: The circuit works!
ru_ru: Если все они совпадают, то мы закончили: схема работает!

source: But in Logisim, all clocks experience ticks at the same rate.
ru_ru: Но в Logisim все тактовые генераторы срабатывают с одинаковой частотой.

source: Loads a library into the project.
ru_ru: Загружает библиотеку в проект.

source: The Portuguese translation was introduced with Logisim 2.6.2 and remains current.
ru_ru: Португальский перевод был представлен в Logisim 2.6.2 и остаётся актуальным.

source: Simple Gray Code Counter
ru_ru: Простой счётчик кода Грея

source: The multiplier (that is, the second of the two numbers to multiply).
ru_ru: Множитель (то есть второе число для перемножения).

source: The bit width of the values to be divided and of the result.
ru_ru: Разрядность значений для деления и результата.

source: // via state.getPort(1).
ru_ru: // через state.getPort(1).

source: Plexers Library
ru_ru: Библиотека Плексоры

source: The truth table for a one-bit buffer is the following.
ru_ru: Таблица истинности для однобитного буфера следующая.

source: The input into the component.
ru_ru: Вход компонента.

source: Blue in Logisim indicates that the value at that point is "unknown," and gray indicates that the wire is not connected to anything.
ru_ru: В Logisim синий показывает, что значение в этой точке "неизвестно", а серый показывает, что провод не подключен ни к чему.

source: Second radix when wire poked: Configures the second part of how wire values are displayed.
ru_ru: Второе основание при нажатии на провод: настраивает вторую часть отображаемого значения.

source: If there are more memory locations than are identified in the file, Logisim will load 0 into the other memory locations.
ru_ru: Если ячеек памяти больше, чем указано в файле, то Logisim загрузит 0 в остальные ячейки.

source: Logisim libraries are projects built within Logisim and saved to the disk as a Logisim project.
ru_ru: Библиотеки Logisim - проекты, построенные в Logisim и сохранённые на диск как проект Logisim.

source: IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING WILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MAY MODIFY AND/OR REDISTRIBUTE THE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES, INCLUDING ANY GENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE USE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED TO LOSS OF DATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY YOU OR THIRD PARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER PROGRAMS), EVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
ru_ru: НИ В КОЕМ СЛУЧАЕ, ЕСЛИ НЕ ТРЕБУЕТСЯ ПОДХОДЯЩИМ ЗАКОНОМ ИЛИ НЕ УСЛОВЛЕНО В ПИСЬМЕННОЙ ФОРМЕ, НИКАКОЙ ДЕРЖАТЕЛЬ АВТОРСКИХ ПРАВ ИЛИ НИКАКОЕ ДРУГОЕ ЛИЦО, КОТОРОЕ МОЖЕТ ИЗМЕНЯТЬ И/ИЛИ ПОВТОРНО РАСПРОСТРАНЯТЬ ПРОГРАММУ, КАК БЫЛО РАЗРЕШЕНО ВЫШЕ, НЕ ОТВЕТСТВЕННЫ ПЕРЕД ВАМИ ЗА УБЫТКИ, ВКЛЮЧАЯ ЛЮБЫЕ ОБЩИЕ, СПЕЦИАЛЬНЫЕ, СЛУЧАЙНЫЕ ИЛИ ПОСЛЕДОВАВШИЕ УБЫТКИ, ПРОИСТЕКАЮЩИЕ ИЗ ИСПОЛЬЗОВАНИЯ ИЛИ НЕВОЗМОЖНОСТИ ИСПОЛЬЗОВАНИЯ ПРОГРАММЫ (ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ ПОТЕРЕЙ ДАННЫХ, ИЛИ ДАННЫМИ, СТАВШИМИ НЕПРАВИЛЬНЫМИ, ИЛИ ПОТЕРЯМИ, ПОНЕСЕННЫМИ ИЗ-ЗА ВАС ИЛИ ТРЕТЬИХ ЛИЦ, ИЛИ ОТКАЗОМ ПРОГРАММЫ РАБОТАТЬ СОВМЕСТНО С ЛЮБЫМИ ДРУГИМИ ПРОГРАММАМИ), ДАЖЕ ЕСЛИ ТАКОЙ ДЕРЖАТЕЛЬ ИЛИ ДРУГОЕ ЛИЦО БЫЛИ ИЗВЕЩЕНЫ О ВОЗМОЖНОСТИ ТАКИХ УБЫТКОВ.

source: Opens a new project in a new window.
ru_ru: Открывает новый проект в новом окне.

source: Creating JAR libraries
ru_ru: Создание JAR библиотек

source: Exit
ru_ru: Выход

source: The Spanish translation was complete as of Logisim 2.1.0, but subsequent Logisim versions have added new options that remain untranslated.
ru_ru: Испанский перевод был полным для Logisim 2.1.0, но последующие версии Logisim добавили новые опции, которые остаются непереведёнными.

source: Developing a JAR library is much more difficult than developing a Logisim library, but the components can be much fancier, including things like attributes and interaction with the user.
ru_ru: Разработка JAR библиотеки гораздо сложнее, чем разработка библиотеки Logisim, но компоненты могут быть гораздо более необычными, в том числе в плане атрибутов и взаимодействия с пользователем.

source: The remaining sections are a motley bunch of reference materials and explanations of some of the lesser corners of Logisim.
ru_ru: Остальные разделы - разнородная куча справочных материалов и объяснений некоторых тонких моментов в Logisim.

source: /** The constructor configures the factory.
ru_ru: /** Конструктор конфигурирует фабрику.

source: (none) & &&
ru_ru: (отсутствие символа) & && AND

source: The toolbar contains tools for adding additional shapes, as listed below with descriptions of how the shift and alt key modifies the tool behavior.
ru_ru: Панель инструментов содержит инструменты для добавления дополнительных фигур, перечисленные ниже с описаниями того, как клавиши Shift и Alt меняют их поведение.

source: GIFEncoder, from Adam Doppelt
ru_ru: GIFEncoder, от Адама Доппельта

source: West edge, labeled en (input, bit width 1)
ru_ru: Западный край, отмечен en (вход, разрядность равна 1)

source: Appearance
ru_ru: Внешний вид

source: // directly onto the canvas.
ru_ru: // непосредственно на холсте.

source: The width that this pin accepts is adaptive: The probe will adapt to inputs of any width.
ru_ru: Разрядность этого контакта адаптивна: датчик приспособится ко входу любой разрядности.

source: For a power element, indicated by a triangle, this value will be one (or, if the Data Bits attribute is more than 1, an all-ones value).
ru_ru: Для элемента Питание, обозначаемого треугольником, это значение будет единицей (или если значение атрибута Биты данных больше единицы, то значение, состоящее из всех единиц).

source: When load and count indicate to decrement, this output is 1 whenever the counter is at 0.
ru_ru: Когда входы загрузка и счёт указывают счётчику уменьшиться, значение на этом выходе 1, если регистр имеет значение 0.

source: For any correct solution, the only output will be 1.
ru_ru: Для каждого правильного решения вывод будет состоять только из 1.

source: Name of circuit on page
ru_ru: Название схемы на странице

source: Logisim provides a handy shortcut for changing the Facing attribute that controls the direction in which many components face: Typing an arrow key while that tool is selected automatically changes the direction of the component.
ru_ru: Logisim предоставляет быстрый удобный метод для изменения атрибута Направление, который управляет направлением, в котором ориентированы многие компоненты: нажатие клавиш со стрелками когда инструмент выбран, автоматически меняет направление компонента.

source: The appearance editor is like a traditional drawing program, but there are a few special symbols for indicating how the drawing works when placed into a circuit's layout.
ru_ru: Редактор внешнего вида похож на традиционную программу для рисования, но есть несколько специальных символов для обозначения того, как рисунок работает при размещении его в чертеже схемы.

source: 1 and 2 above on a medium customarily used for software interchange; or,
ru_ru: 1 и 2, приведенными выше, на носителе, обычно используемом для обмена ПО; или,

source: The direction in which the arrow will point from the location of its pin.
ru_ru: Направление, в котором указывает стрелка, выходящая из контакта компонента.

source: If, as a consequence of a court judgment or allegation of patent infringement or for any other reason (not limited to patent issues), conditions are imposed on you (whether by court order, agreement or otherwise) that contradict the conditions of this License, they do not excuse you from the conditions of this License.
ru_ru: Если в результате судебного разбирательства, или обвинения в нарушении патента или по любой другой причине (не обязательно связанной с патентами), вам навязаны условия, противоречащие данной Лицензии (как по решению суда, так и нет), то это не освобождает вас от соблюдения Лицензии.

source: Nonetheless, to view and edit values within the circuit, the Poke Tool has two modes of operation: You can edit the address displayed, and you can edit an individual value.
ru_ru: Тем не менее, для просмотра и редактирования значений в схеме Инструмент Нажатие имеет два режима работы: вы можете изменять отображаемый адрес и отдельное значение.

source: A probe component has only one pin, which will acts as an input to the probe.
ru_ru: Компонент датчик имеет только один контакт, который является входом для датчика.

source: The following little circuit illustrates all of them at once.
ru_ru: Следующая небольшая схема демонстрирует их все одновременно.

source: You may modify your copy or copies of the Program or any portion of it, thus forming a work based on the Program, and copy and distribute such modifications or work under the terms of Section 1 above, provided that you also meet all of these conditions:
ru_ru: Вы можете изменять свою копию или копии Программы или любой ее части, создавая таким образом произведение, основанное на Программе, и копировать и распространять эти модификации или произведение в соответствии с Разделом 1, приведенным выше, при условии, что вы выполните все нижеследующие условия:

source: Some users, though, thought it would be nice to include.)
ru_ru: Некоторые пользователи, однако, подумали, что было бы неплохо включить этот компонент в библиотеку.)

source: When the counter reaches this value, the next increment wraps the counter back to 0; and if it is at 0, then a decrement will wrap the counter around back to its maximum value.
ru_ru: Когда счётчик достигает этого значения, следующее увеличение возвращает значение счётчика обратно к 0; а если значение счётчика 0, то уменьшение возвратит счётчик к его максимальному значению.

source: I/O library: Button and LED components
ru_ru: Библиотека Ввод/вывод: компоненты Кнопка и Светодиод
